<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
                              "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="em">  
      <head>
            <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
            <link rel="stylesheet" href="css/v4.css" type="text/css" media="screen" />
            <link rel="stylesheet" href="css/screen.css" type="text/css" media="screen" />
            <link rel="stylesheet" href="css/print.css" type="text/css" media="print" />

                                               <title>Cuarta Jornada de Doctorandos de Computaci&oacute;n</title>
      </head>

      <body>
      <div id="pageWrapper">
      
      <hr class="hide" />
      
      <div id="masthead" class="inside">
            <h1>Cuarta Jornada de Doctorandos de Computaci&oacute;n <br/> FaMAF, Universidad Nacional de C&oacute;rdoba</h1>
            <h2>2 de Diciembre, 2013</h2>
      </div>

      <hr class="hide" />

      <div class="hnav"> 
      
     
      </div> <!-- End HNAV -->
      
      <div id="outerColumnContainer">
            <div id="innerColumnContainer">
            
                  <hr class="hide" />

                  <div id="leftColumn">
                        <div class="inside">
<div class="vnav">
	<h3></h3>
	<ul>
        <li><a href="index.php#introduccion">Introducci&oacute;n</a></li>
        <li><a href="index.php#participantes">Participantes</a></li>
        <li><a href="index.php#programa">Programa</a></li>
        <li><a href="wisdom.php">Wisdom</a></li>
    </ul>
		
        
</div> <!-- End VNAV -->

<br/>

</div> <!-- End INSIDE -->
                        
</div>

<hr class="hide" />

<div id="rightColumn">
<div class="inside">

</div>
</div>
<div id="contentColumn">
	<hr class="hide" />
	<a name="skipToContent"></a>
	<div class="inside">
	
<a name="introduccion"></a>
<h3>Introducci&oacute;n</h3>

<p>
Esta es la cuarta Jornada de Doctorandos de Computaci&oacute;n de la
Facultad de Matem&aacute;tica, Astronom&iacute;a y F&iacute;sica (FaMAF).
</p>

<p>
En esta jornada, los estudiantes del Doctorado en Ciencias de la
Computaci&oacute;n de FaMAF expondr&aacute;n sus intereses de
investigaci&oacute;n y los aspectos m&aacute;s relevantes de su
trabajo.
</p>

<p>
Uno de los principales objetivos de la jornada es dar a conocer las
l&iacute;neas de investigaci&oacute;n que los doctorandos de
Computaci&oacute;n del FaMAF est&aacute;n desarrollando, y por eso
invitamos a todos los alumnos y docentes (no s&oacute;lo a los de
Computaci&oacute;n) a concurrir.
</p>

<a name="participantes"></a>
<h3>Participantes Confirmados <a href="index.php#introduccion">^</a></h3>

Ac&aacute; ponemos la lista de todos los doctorandos que participan de
las jornadas, en orden alfab&eacute;tico y con e-mail. As&iacute; el
que est&eacute; interesado los puede buscar y/o/implica/forall
contactar.

<ul>

  <li>Ivana Romina Altamirano (romina.altamirano@gmail.com)</li>
  <li>Valeria Bengolea (valebengolea@gmail.com)</li>
  <li>Carlos Budde (cbudde@famaf.unc.edu.ar)</li>
  <li>Cristian Cardellino (crscardellino@gmail.com)</li>
  <li>Renzo Degiovanni (rdegiovanni@dc.exa.unrc.edu.ar)</li>
  <li>Cecilia Kilmurray (ckilmurray@dc.exa.unrc.edu.ar)</li>
  <li>Nicol&aacute;s Ricci (nricci.02@gmail.com) </li>
  <li>Eduardo Romero (romeroe@famaf.unc.edu.ar)</li>
  <li>Mart&iacute;n Vilela (demetriomeister@gmail.com) </li>

</ul>

<h3>Programa del Evento <a href="index.php#introduccion">^</a></h3>
<a name="programa"></a>

<div class="datagrid">
<center>
<table>
<colgroup>
       <col span="1" style="width: 10%;">
       <col span="1" style="width: 90%;">
</colgroup>

<thead><tr><th>Horario</th> <th>Charla</th></tr></thead>

<tbody>
<tr>
  <td>10:00</td><td> Cecilia Kilmurray</td></tr> 
<tr class="alt">
  <td>10:45</td><td> Carlos Budde</td></tr>
<tr>
  <td>11:00</td><td> <strong>Caf&eacute;</strong></td></tr>				
<tr class="alt">
  <td>11:30</td><td> Valeria Bengolea</td></tr> 
<tr>
  <td>12:15</td><td> Nicol&aacute;s Ricci</td></tr> 
<tr class="alt">
  <td>12:30</td><td> <strong>Charla Invitada:</strong> Andreas Herzig [IRIT]</td></tr>	
<tr>
  <td>12:50</td><td> <strong>Almuerzo</strong></td></tr>				
<tr class="alt">
  <td>14:30</td><td> Renzo Degiovanni</td></tr> 
<tr>
  <td>15:15</td><td> Ivana Romina Altamirano</td></tr> 
<tr class="alt">
  <td>16:00</td><td> <strong>Caf&eacute;</strong></td></tr>				
<tr>
  <td>16:30</td><td> Cristian Cardellino</td></tr> 
<tr class="alt">
  <td>17:15</td><td> <strong>Charla Invitada:</strong> Cesar Bernardini [LORIA]</td></tr> 
<tr>
  <td>17:45</td><td> Mart&iacute;n Vilela</td></tr> 
<tr class="alt">
  <td>18:00</td><td> Eduardo Romero</td></tr> 

</tbody>
</table>
</center>

</div>

<ul>
  <li> 
    <strong>T&iacute;tulo:</strong> <i>RPCTL: Una L&oacute;gica para Tolerancia a Fallas</i><br/>
    <strong>Expositor:</strong> Cecilia Kilmurray<br/>
    <strong>Abstract:</strong> En la actualidad la tolerancia a fallas
cada vez adquiere mas importancia, esto se debe a que cada d&iacute;a hay mas
sistemas cr&iacute;ticos en donde es necesario garantizar cierto
comportamiento deseado a&uacute;n ante la ocurrencia ocasional de fallas.  En
esta charla presentar&eacute; una extensi&oacute;n de la l&oacute;gica PCTL con f&oacute;rmulas
recursivas, lo cual aumenta la expresividad de PCTL pero manteniendo
la complejidad del problema de model checking polinomial. Creemos que
la principal aplicaci&oacute;n de esta l&oacute;gica, a la cual llamamos RPCTL, ser&aacute;
la abstracci&oacute;n y verificaci&oacute;n de propiedades probabil&iacute;sticas de
sistemas tolerantes a fallas, ya que los operadores recursivos
permiten justamente caracterizar muchas de las nociones que aparecen
en propiedades de tolerancia falla, como la de permanecer o visitar
con cierta frecuencia una regi&oacute;n del sistema.  En particular mostrar&eacute;
algunos ejemplos para ilustrar la capacidad de nuestra l&oacute;gica para
capturar nociones relacionadas con tolerancia a fallas.  Culminar&eacute;
presentando alguna de las lineas de investigaci&oacute;n a seguir en un
futuro. <a href="Slides/kilmurray.pdf">[pdf]</a><br/><br/>
  </li>

  <li> 
    <strong>T&iacute;tulo: </strong> Simulaci&oacute;n de eventos raros - Automatizando RESTART<br/>
    <strong>Expositor:</strong> Carlos Budde<br/>
    <strong>Abstract:</strong> RESTART es un m&eacute;todo de simulaci&oacute;n
  basado en t&eacute;cnicas de \emph{importance splitting}, que busca estimar
  eficientemente la probabilidad de ocurrencia de un evento
  raro. Se aplica en cualquier escenario de modelado de sistemas
  donde la probabilidad de alcanzar el \emph{conjunto raro de estado}
  descarta el uso de m&eacute;todos de simulaci&oacute;n tradicionales, e.g. fallas
  en un sistema robusto.  En esta (muy breve) charla se describir&aacute; a
  grandez razgos el escenario de aplicaci&oacute;n de RESTART, luego el
  m&eacute;todo en s&iacute;, y finalmente algunas problem&aacute;ticas relacionadas que
  conforman el tema de estudio actual del doctorando.<br/><br/>
  </li>

  <li> 
    <strong>T&iacute;tulo:</strong> <i>Testing Exhaustivo Acotado,
    problemas y posibles soluciones</i><br/>
    <strong>Expositor:</strong> Valeria Bengolea <br/>
    <strong>Abstract:</strong> Testing es una de las t&eacute;cnicas mas
    usadas actualmente para asegurar la calidad de software. Esta
    t&eacute;cnica consiste en ejecutar una pieza de software con diferentes
    entradas para luego chequear si el resultado obtenido se
    corresponde con el resultado esperado. En este contexto, la
    generaci&oacute;n autom&aacute;tica de casos de test es una &aacute;rea de
    investigaci&oacute;n muy activa en la actualidad, dentro de la cual la
    generaci&oacute;n de casos de test para estructuras complejas alojadas en
    memoria din&aacute;mica, tales como &aacute;rboles balanceados, grafos, etc., es
    particularmente compleja debido a las restricciones que estas
    estructuras deben satisfacer para ser consideradas v&aacute;lidas o bien
    formadas. Muchas herramientas/t&eacute;cnicas han sido desarrolladas para
    abordar este problema. La generaci&oacute;n exhaustiva acotada de casos
    de test es una de ellas. Esta es usada en muchos contextos pero
    particularmente &uacute;til cuando se trata de este tipo de
    estructuras. A lo largo de mi doctorado he estudiado en detalle el
    testing exhaustivo acotado, y los problemas que &eacute;ste
    presenta. Gran parte de mi trabajo estuvo enfocado (y lo sigue
    estando) en el desarrollo de t&eacute;cnicas que ayuden a mejorar el
    testing exhaustivo acotado. En este seminario contar&eacute; de que se
    trata esta t&eacute;cnica particularmente para el caso de estructuras
    complejas alojadas en memoria din&aacute;mico, algunos problemas y varias
    t&eacute;cnicas desarrolladas para abordar estos
    problemas. <a href="Slides/bengolea.pdf">[pdf]</a><br/><br/>
  </li>


  <li> 
    <strong>T&iacute;tulo:</strong> <i>Nociones de tolerancia a fallas</i><br/>
    <strong>Expositor:</strong> Nicol&aacute;s Ricci<br/>
    <strong>Abstract:</strong> En esta charla se exponen algunas
nociones sobre sistemas tolerantes a fallas.  Para esto se muestran
distintos tipos de relaciones de simulaci&oacute;n definidas especialmente
para capturar la noci&oacute;n de que un sistema preserva un cierto
"comportamiento ideal" mientras que tolera la ocurrencia de
fallas. Los tipos de simulaci&oacute;n abordados son tres, y se corresponden
con distintos niveles de tolerancia a fallas.  Adem&aacute;s se mostrar&aacute; que
cada uno de estos posee una caracterizaci&oacute;n l&oacute;gica. Para esto se
presentar&aacute; la l&oacute;gica DCTL (Deontic Computation Tree Logic) que es una
expansi&oacute;n de CTL que permite hablar sobre el comportamiento normal de
un sistema. Finalmente se presentaran algunas lineas de trabajo
actuales que tienen como fin realizar sintes&iacute;s sobre especificaciones
DCTL.<a href="Slides/ricci.pdf">[pdf]</a><br/><br/>
  </li>

  <li>
    <strong>T&iacute;tulo:</strong> <i>Doing a Phd in logic-related
    areas: dos and don'ts</i><br/>
    <strong>Expositor:</strong> Andreas Herzig<br/>
    <strong>Abstract:</strong> Nos est&aacute; visitando el Prof. Andreas
   Herzig, investigador CNRS (Directeur de Recherches CNRS) del Logic,
   Interaction, Language, and Computation Group (LILaC) del IRIT en la
   Universit&eacute; Paul Sabatier, Toulouse, Francia.  En esta charla Andreas
   nos contar&aacute; algunas de sus experiencias durante su doctorado.
   <a href="Slides/herzig.pdf">[pdf]</a>
   <br/><br/>

  </li>

  <li> 
    <strong>T&iacute;tulo:</strong> <i>Operacionalizaci&oacute;n Autom&aacute;tica de
    Goals basada en Interpolaci&oacute;n y SAT Solving</i><br/>
    <strong>Expositor:</strong> Renzo Degiovanni<br/>
    <strong>Abstract:</strong> Uno de los formalismos mas utilizados
    actualmente para la captura de requisitos de software, son las
    especificaciones orientadas a objetivos. Un objetivo, o "goal", es
    una propiedad que nuestro sistema debe cumplir. Los goals que son
    asignados a agentes, deben ser operacionalizados: las operaciones
    del agente deben ser refinadas, incorporando pre condiciones o
    condiciones de disparo adecuadas, de manera tal que el objetivo
    sea satisfecho. Existen varios m&eacute;todos para lidiar con este
    problema, pero en su mayor&iacute;a son informales o a lo sumo semi
    autom&aacute;ticos, demandando al ingeniero su asistencia en el
    proceso.<br/>  En este seminario, voy a presentar un m&eacute;todo para
    la operacionalizaci&oacute;n de goals que autom&aacute;ticamente computa las pre
    condiciones y condiciones de disparo requeridas, tal que las
    operaciones resultantes satisfacen los goals. El proceso es
    iterativo, es capaz de lidiar con goals de safety y tipos
    particulares de liveness, y esta basado en el uso de interpolaci&oacute;n
    y SAT Solving. <a href="Slides/degiovanni.pdf">[pdf]</a><br/><br/>
  </li>

  <li> 
    <strong>T&iacute;tulo:</strong> <i>Evaluaci&oacute;n de un algoritmo de
    refinamiento para la generaci&oacute;n de expresiones referenciales</i><br/>
    <strong>Expositor:</strong> Ivana Romina Altamirano<br/>
    <strong>Abstract:</strong> En este seminario describir&eacute; y mostrar&eacute;
    la evaluaci&oacute;n de un algoritmo para generaci&oacute;n de expresiones
    referenciales que usa regresi&oacute;n lineal para aprender la
    probabilidad de usar una cierta propiedad para describir un objeto
    en una escena particular. El algoritmo que presento es una
    extensi&oacute;n de un algoritmo de refinamiento para tener en cuenta
    probabilidades aprendidas de un corpus. Como resultado el
    algoritmo es capaz no solo de generar expresiones referenciales
    correctas que univocamente identifican al referente sino que
    tambi&eacute;n genera expresiones referenciales que son consideradas
    iguales o mejores que aquellas generadas por humanos por un juez
    humano en 92% de los casos. Dar&eacute; ejemplos de expresiones
    referenciales que los humanos prefieren.<a href="Slides/altamirano.pdf">[pdf]</a><br/><br/>
  </li>

  <li> 
    <strong>T&iacute;tulo:</strong> Incorporando Inteligencia a la
    Extracci&oacute;n de Informaci&oacute;n<br/>
    <strong>Expositor:</strong> Cristian Cardellino<br/>
    <strong>Abstract:</strong> El &aacute;rea de la Extracci&oacute;n de Informaci&oacute;n
    (EI), particularmente el minado de hechos (Fact Mining), es de
    interesantes aplicaciones en la actualidad. Nosotros estamos
    estudiando recursos l&eacute;xicos verbales para su la incorporaci&oacute;n de
    su informaci&oacute;n a procesos est&aacute;ndares de EI. Dichos recursos son
    extendidos enriqueci&eacute;ndolos con informaci&oacute;n l&eacute;xica de corpus,
    utilizando m&eacute;todos semi-supervisados para mejorar la
    desambiguaci&oacute;n autom&aacute;tica de los sentidos verbales. El resultado
    final de esto es automatizar la creaci&oacute;n de robots de EI a partir
    de los recursos ling&uuml;&iacute;sticos estudiados. <a href="Slides/cardellino.pdf">[pdf]</a><br/><br/>
  </li>

  <li> <strong>T&iacute;tulo:</strong>Doctorado en el Exterior, es
    posible?<br/> <strong>Expositor:</strong> Cesar Bernardini<br/>
    <strong>Abstract:</strong> En esta charla comento mi experiencia
    en los primeros dos a&ntilde;os de doctorado en Francia en el Instituto
    Nacional de Recherche en Informatique et Automatique (INRIA) en la
    ciudad de Nancy. El objetivo de esta charla es transmitir mi
    experiencia como ex egresado de FaMAF tanto desde el punto de
    vista cient&iacute;fico como desde el punto de vista
    humano. Incluyendo aspectos como la decisi&oacute;n del instituto,
    los temas del doctorado, financiamiento en el exterior, la ciudad,
    los supervisores, entre otros aspectos.<br/><br/> </li>

  <li> 
    <strong>T&iacute;tulo:</strong> Agda, Un lenguaje picante<br/>
    <strong>Expositor:</strong> Mart&iacute;n Vilela<br/>
    <strong>Abstract:</strong> TBS<br/><br/>
  </li>


  <li> 
    <strong>T&iacute;tulo:</strong> OR Aplicada a la Planificaci&oacute;n de
    Adquisiciones de Im&aacute;genes Satelitales<br/>
    <strong>Expositor:</strong> Eduardo Romero<br/>
    <strong>Abstract:</strong> En esta charla se presenta la
    aplicaci&oacute;n de t&eacute;cnicas de Investigaci&oacute;n Operativa al problema de
    planificaci&oacute;n de adquisiciones de im&aacute;genes satelitales. Tambi&eacute;n se
    comenta sobre coincidencias entre el modelo MIP usado y la forma
    de modelar la evoluci&oacute;n de los recursos en el Planner COLIN (un
    planner que soporta "COntinuous LINear numeric
    changes"). <a href="Slides/romero.pdf">[pdf]</a><br/><br/>
  </li>

  
</ul>

<br/>
<br/>

</div>
					</div>
					
          
<div class="clear mozclear"></div>
				</div>
			</div>
			<div class="hide" id="nsFooterClear"><!-- for NS4s sake --></div>
			<hr class="hide" />
			<div id="footer" class="inside">

<p style="margin:0;">
	<span style="color:#cc9;">
<a href="http://validator.w3.org/check/referer">
                 <img src="images/xhtml10.png" align="middle" alt="xhtml" width="80" height="15" style="border-width:0;"/>
             </a>
        &copy; 2013 Maintained by Areces. Last updated: Nov-2013.
<a href="http://jigsaw.w3.org/css-validator/check/referer">
                <img src="images/css.png"  align="middle" alt="CSS" width="80" height="15" style="border-width:0;"/>
             </a>
        </span>
</p>

			</div>
			<hr class="hide" />
		</div>
	</body>
</html>
